# Задача: предложить улучшения кода для уже решённых задач (3-5 задач):
# С помощью использования: lambda, filter, map, zip, enumerate, list comprehension.
# -------------------------------------------------------------------------------------------------
# Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# Пример:
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

li = [1, 2, 3, 5, 1, 5, 3, 10]

nonRepeatingFilter = list(
    filter(lambda i: not ((i in li[: li.index(i)]) or (i in li[li.index(i) + 1 :])), li)
)
print(f"Result: {li} => {nonRepeatingFilter}")
